vacations/src/DataProcessors/МС_ГрафикОтпусковСотрудников/МС_ГрафикОтпусковСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МС_ГрафикОтпусковСотрудников</name>
  <attributes>
    <name>ВариантОтображенияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

vacations/src/InformationRegisters/МС_ОстаткиОтпусков/МС_ОстаткиОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_ОстаткиОтпусков</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

vacations/src/InformationRegisters/МС_ГрафикОтпусков/МС_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_ГрафикОтпусков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.МС_СтатусыЗаявкиНаОтпуск</types>
    </type>
  </resources>
  <resources>
    <name>ВидОтпуска</name>
    <type>
      <types>EnumRef.МС_ВидыОтпусков</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДеньПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

vacations/src/Enums/МС_СтатусыЗаявкиНаОтпуск/МС_СтатусыЗаявкиНаОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МС_СтатусыЗаявкиНаОтпуск</name>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

vacations/src/Documents/МС_ЗаявкаНаОтпуск/МС_ЗаявкаНаОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МС_ЗаявкаНаОтпуск</name>
  <registerRecords>InformationRegister.МС_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.МС_ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.МС_СтатусыЗаявкиНаОтпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

vacations/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>АПК:413 История выбора важна для отв.лиц. Из-за наличия ОбработкаПолученияДанныхВыбора должна отключаться в потребителях</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:Catalog>

vacations/src/DataProcessors/МС_ГрафикОтпусковСотрудников/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьНачальныйОстаток(Сотрудник, ТаблицаОстатков)
	
	СтрокаТЗ = ТаблицаОстатков.Найти(Сотрудник, "Сотрудник");
	
	Рез = 0;
	Если НЕ СтрокаТЗ = Неопределено Тогда
		Рез = СтрокаТЗ.НачОстаток;
	КонецЕсли;
	
	Возврат Рез;

КонецФункции // ПолучитьНачальныйОстаток()

&НаСервере
Функция ПолучитьТаблицуОстатковНаНачалоГода(ДатаНач)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Сотрудник КАК Сотрудник,
	|	Т.КоличествоДней КАК НачОстаток
	|ИЗ
	|	РегистрСведений.МС_ОстаткиОтпусков.СрезПоследних(&ПериодСреза, ) КАК Т";
	
	Запрос.УстановитьПараметр("ПериодСреза", НачалоГода(ДатаНач) + 3600);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьТаблицуОстатковНаНачалоГода()

&НаСервере
Функция ПечатьГрафикОтпусковСотрудников()

	УстановитьПривилегированныйРежим(Истина);
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	
	ДокументРезультат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка,
	|	Спр.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_ФЛ
	|ИЗ
	|	Справочник.ФизическиеЛица КАК Спр
	|ГДЕ
	|	НЕ Спр.Ссылка В ИЕРАРХИИ
	|		(ВЫБРАТЬ
	|			Спр1.Ссылка
	|		ИЗ
	|			Справочник.ФизическиеЛица КАК Спр1
	|		ГДЕ
	|			Спр1.ЭтоГруппа
	|			И Спр1.Наименование = ""Уволенные"")
	|	И ВЫБОР
	|		КОГДА &ЕстьОтборПоСотруднику
	|			ТОГДА Спр.Ссылка = &ОтборПоСотруднику
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.ФИО КАК ФИО,
	|	Т.ДеньПериода КАК ДеньПериода,
	|	Т.Статус КАК Статус,
	|	Т.Вид КАК Вид,
	|	Т.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_1
	|ИЗ
	|	(ВЫБРАТЬ
	|		Сотрудники.Ссылка КАК Ссылка,
	|		Сотрудники.Ссылка.Наименование КАК ФИО,
	|		ГрафикОтпусков.ДеньПериода КАК ДеньПериода,
	|		ГрафикОтпусков.ВидОтпуска КАК Вид,
	|		ГрафикОтпусков.Статус КАК Статус,
	|		ГрафикОтпусков.Регистратор КАК Регистратор
	|	ИЗ
	|		ВТ_ФЛ КАК Сотрудники
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МС_ГрафикОтпусков.СрезПоследних(,) КАК ГрафикОтпусков
	|			ПО Сотрудники.Ссылка = ГрафикОтпусков.Сотрудник) КАК Т
	|ГДЕ
	|	Т.ДеньПериода МЕЖДУ &Дата1 И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ФЛ.Ссылка КАК ФЛ,
	|	ВТ_ФЛ.Подразделение КАК Отдел
	|ПОМЕСТИТЬ ВТ_Отделы
	|ИЗ
	|	ВТ_ФЛ КАК ВТ_ФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ФЛ.Ссылка КАК Ссылка,
	|	ВТ_1.ФИО КАК ФИО,
	|	ЕСТЬNULL(ВТ_1.ДеньПериода, ДАТАВРЕМЯ(1, 1, 1)) КАК ДеньПериода,
	|	ЕСТЬNULL(ВТ_1.Статус, ЗНАЧЕНИЕ(Перечисление.МС_СтатусыЗаявкиНаОтпуск.ПустаяСсылка)) КАК Статус,
	|	ЕСТЬNULL(ВТ_1.Вид, ЗНАЧЕНИЕ(Перечисление.МС_ВидыОтпусков.ПустаяСсылка)) КАК Вид,
	|	ЕСТЬNULL(ВТ_1.Регистратор, ЗНАЧЕНИЕ(Документ.МС_ЗаявкаНаОтпуск.ПустаяСсылка)) КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Готово
	|ИЗ
	|	ВТ_ФЛ КАК ВТ_ФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_1 КАК ВТ_1
	|		ПО ВТ_ФЛ.Ссылка = ВТ_1.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.Отдел КАК Отдел,
	|	Т1.Сотрудник КАК Сотрудник,
	|	Т1.ФИО КАК ФИО,
	|	Т1.Регистратор КАК Регистратор,
	|	Т1.ДеньПериода КАК ДеньПериода,
	|	Т1.Статус КАК Статус,
	|	Т1.Вид КАК Вид
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Отдел КАК Отдел,
	|		Т.Сотрудник КАК Сотрудник,
	|		Т.ФИО КАК ФИО,
	|		Т.Регистратор КАК Регистратор,
	|		Т.ДеньПериода КАК ДеньПериода,
	|		Т.Статус КАК Статус,
	|		Т.Вид КАК Вид
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВТ_Отделы.Отдел КАК Отдел,
	|			ВТ_Готово.Ссылка КАК Сотрудник,
	|			ВТ_Готово.Ссылка.Наименование КАК ФИО,
	|			ВТ_Готово.ДеньПериода КАК ДеньПериода,
	|			ВТ_Готово.Статус КАК Статус,
	|			ВТ_Готово.Вид КАК Вид,
	|			ВТ_Готово.Регистратор КАК Регистратор
	|		ИЗ
	|			ВТ_Готово КАК ВТ_Готово
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отделы КАК ВТ_Отделы
	|				ПО ВТ_Готово.Ссылка = ВТ_Отделы.ФЛ) КАК Т
	|	ГДЕ
	|		НЕ Т.ФИО = ""Барышева Анна Николаевна""
	|		И НЕ Т.Отдел ЕСТЬ NULL
	|		И ВЫБОР
	|			КОГДА &ЕстьОтборПоОтделу
	|				ТОГДА Т.Отдел = &ОтборПоОтделу
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА &ЕстьОтборПоВидуОтпуска
	|				ТОГДА Т.Вид = &ОтборПоВидуОтпуска
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА &ЕстьОтборПоСтатусам
	|				ТОГДА Т.Статус В (&МассивСтатусов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК Т1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т1.Отдел.Наименование,
	|	Т1.ФИО,
	|	Т1.ДеньПериода
	|ИТОГИ
	|	МАКСИМУМ(ФИО)
	|ПО
	|	Отдел,
	|	Сотрудник,
	|	Регистратор";
	
	Запрос.УстановитьПараметр("ЕстьОтборПоСотруднику", 	ЗначениеЗаполнено(ОтборПоСотруднику));
	Запрос.УстановитьПараметр("ОтборПоСотруднику", 		ОтборПоСотруднику);
	Запрос.УстановитьПараметр("Дата1", 					НачалоДня(ПериодОтчета.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2", 					КонецДня(ПериодОтчета.ДатаОкончания));
	Запрос.УстановитьПараметр("ЕстьОтборПоОтделу", 		ЗначениеЗаполнено(ОтборПоПодразделению));
	Запрос.УстановитьПараметр("ОтборПоОтделу", 			ОтборПоПодразделению);
	Запрос.УстановитьПараметр("ЕстьОтборПоВидуОтпуска", ЗначениеЗаполнено(ОтборПоВидуОтпуска));
	Запрос.УстановитьПараметр("ОтборПоВидуОтпуска", 	ОтборПоВидуОтпуска);
	
	ЕстьОтборПоСтатусам = Ложь;
	МассивСтатусов = Новый Массив;
	Если флВыводитьЗаявки Тогда
		МассивСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Заявка);
	Иначе
		ЕстьОтборПоСтатусам = Истина;
	КонецЕсли;
	Если флВыводитьСогласованные Тогда
		МассивСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Согласована);
	Иначе
		ЕстьОтборПоСтатусам = Истина;
	КонецЕсли;
	Если флВыводитьУтвержденные Тогда
		МассивСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Утверждена);
	Иначе
		ЕстьОтборПоСтатусам = Истина;
	КонецЕсли;
	Если флВыводитьВыполненные Тогда
		МассивСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Выполнена);
	Иначе
		ЕстьОтборПоСтатусам = Истина;
	КонецЕсли;
	Если флВыводитьОтмененные Тогда
		МассивСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Отменена);
	Иначе
		ЕстьОтборПоСтатусам = Истина;
	КонецЕсли;
	Запрос.установитьПараметр("ЕстьОтборПоСтатусам", ЕстьОтборПоСтатусам);
	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	
	ВыборкаПоОтделам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Обл1 = Макет.ПолучитьОбласть("ЗаголовокТаблицы|ОсновнаяКолонка");
	Обл_31 = Макет.ПолучитьОбласть("ЗаголовокТаблицы|КолонкаМесяца_31");
	Обл_30 = Макет.ПолучитьОбласть("ЗаголовокТаблицы|КолонкаМесяца_30");
	Обл_28 = Макет.ПолучитьОбласть("ЗаголовокТаблицы|КолонкаМесяца_28");
	Обл_29 = Макет.ПолучитьОбласть("ЗаголовокТаблицы|КолонкаМесяца_29");
	
	Обл_Итого = Макет.ПолучитьОбласть("ЗаголовокТаблицы|Итого");
	
	Обл_НачОстаток = Макет.ПолучитьОбласть("ЗаголовокТаблицы|НачОстаток");
	Обл_КонОстаток = Макет.ПолучитьОбласть("ЗаголовокТаблицы|КонОстаток");
	
	ДокументРезультат.Вывести(Обл1);
	
	МассивМесяцов = ПодготовитьМассивМесяцов(ПериодОтчета.ДатаНачала, ПериодОтчета.ДатаОкончания);
	
	Пока ВыборкаПоОтделам.Следующий() Цикл
		
		ВыборкаПоСотрудникам = ВыборкаПоОтделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоСотрудникам.Следующий() Цикл
			
			ДокументРезультат.Присоединить(Обл_НачОстаток);
			
			Для Каждого ТекМесяц Из МассивМесяцов Цикл
				
				КонецТекМесяца = День(ТекМесяц);
				Если КонецТекМесяца = 28 Тогда
					Обл_28.Параметры.Месяц = Формат(ТекМесяц, "ДФ=MMMM");
					ДокументРезультат.Присоединить(Обл_28);
				ИначеЕсли КонецТекМесяца = 29 Тогда
					Обл_29.Параметры.Месяц = Формат(ТекМесяц, "ДФ=MMMM");
					ДокументРезультат.Присоединить(Обл_29);
				ИначеЕсли КонецТекМесяца = 30 Тогда
					Обл_30.Параметры.Месяц = Формат(ТекМесяц, "ДФ=MMMM");
					ДокументРезультат.Присоединить(Обл_30);
				ИначеЕсли КонецТекМесяца = 31 Тогда
					Обл_31.Параметры.Месяц = Формат(ТекМесяц, "ДФ=MMMM");
					ДокументРезультат.Присоединить(Обл_31);
				КонецЕсли;
				
			КонецЦикла;
			
			Прервать;
			
		КонецЦикла;
		
		Прервать;
		
	КонецЦикла;
	
	ДокументРезультат.Присоединить(Обл_Итого);
	ДокументРезультат.Присоединить(Обл_КонОстаток);
	
	ОстаткиНаНачалоГода = ПолучитьТаблицуОстатковНаНачалоГода(ПериодОтчета.ДатаНачала);
	
	ВыборкаПоОтделам.Сбросить();
	
	СчетчикСтрок = 2;
	
	Обл1             = Макет.ПолучитьОбласть("СтрокаТаблицы|ОсновнаяКолонка");
	Обл_31           = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаМесяца_31");
	Обл_30           = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаМесяца_30");
	Обл_28           = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаМесяца_28");
	Обл_29           = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаМесяца_29");
	Обл_Итого        = Макет.ПолучитьОбласть("СтрокаТаблицы|Итого");
	Обл_НачОст       = Макет.ПолучитьОбласть("СтрокаТаблицы|НачОстаток");
	Обл_КонОст       = Макет.ПолучитьОбласть("СтрокаТаблицы|КонОстаток");

	Обл1_отдел       = Макет.ПолучитьОбласть("СтрокаОтдела|ОсновнаяКолонка");
	Обл_31_отдел     = Макет.ПолучитьОбласть("СтрокаОтдела|КолонкаМесяца_31");
	Обл_30_отдел     = Макет.ПолучитьОбласть("СтрокаОтдела|КолонкаМесяца_30");
	Обл_28_отдел     = Макет.ПолучитьОбласть("СтрокаОтдела|КолонкаМесяца_28");
	Обл_29_отдел     = Макет.ПолучитьОбласть("СтрокаОтдела|КолонкаМесяца_29");
	Обл_НачОст_отдел = Макет.ПолучитьОбласть("СтрокаОтдела|НачОстаток");
	Обл_КонОст_отдел = Макет.ПолучитьОбласть("СтрокаОтдела|КонОстаток");
	Обл_Итого_отдел  = Макет.ПолучитьОбласть("СтрокаОтдела|Итого");
	
	НПП = 1;
	
	ЦветЗаявки 			= Новый Цвет(255,255,0);
	ЦветСогласовано 	= Новый Цвет(153,204,0);
	ЦветУтверждено 		= Новый Цвет(32,178,170);
	ЦветОтчетныйПериод 	= Новый Цвет(255,204,0);
	ЦветВыполнено 		= Новый Цвет(0,204,255);
	ЦветОтменено 		= Новый Цвет(255,102,0);
	ЦветОбычный 		= Новый Цвет(255,255,255);
	ЦветЧерный			= Новый Цвет(13,15,17);
	
	СплошнаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	ТочечнаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Точечная, 1);
	НетЛинии = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	
	КоличествоКолонокСДанными = 3;
	
	ТаблицаПересеченийВОтделе = Новый ТаблицаЗначений;
	ТаблицаПересеченийВОтделе.Колонки.Добавить("Отдел");
	ТаблицаПересеченийВОтделе.Колонки.Добавить("Сотрудник");
	ТаблицаПересеченийВОтделе.Колонки.Добавить("ДеньПериода");
	ТаблицаПересеченийВОтделе.Колонки.Добавить("КолвоЗаявок");
	
	Пока ВыборкаПоОтделам.Следующий() Цикл
		ВыборкаПоСотрудникам = ВыборкаПоОтделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоСотрудникам.Следующий() Цикл
			ВыборкаПоЗаявкам = ВыборкаПоСотрудникам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоЗаявкам.Следующий() Цикл
				ВыборкаПоДням = ВыборкаПоЗаявкам.Выбрать();
				Пока ВыборкаПоДням.Следующий() Цикл
					Если НЕ ВыборкаПоДням.Статус = Перечисления.МС_СтатусыЗаявкиНаОтпуск.Отменена Тогда
						НовСтр = ТаблицаПересеченийВОтделе.Добавить();
						НовСтр.Отдел = ВыборкаПоОтделам.Отдел;
						НовСтр.Сотрудник = ВыборкаПоСотрудникам.Сотрудник;
						НовСтр.ДеньПериода = ВыборкаПоДням.ДеньПериода;
						НовСтр.КолвоЗаявок = 1;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаПересеченийВОтделе.Свернуть("Отдел,ДеньПериода", "КолвоЗаявок");
	СтрокиДляУдаления = ТаблицаПересеченийВОтделе.НайтиСтроки(Новый Структура("КолвоЗаявок", 1));
	Для Каждого УдСтрока Из СтрокиДляУдаления Цикл
		ТаблицаПересеченийВОтделе.Удалить(УдСтрока);
	КонецЦикла;
	
	ТаблицаПересеченийВОтделе.Сортировать("Отдел, ДеньПериода ВОЗР, КолвоЗаявок УБЫВ");
	//Для Каждого ТекСтр Из ТаблицаПересеченийВОтделе Цикл
	//	Если ТекСтр.КолвоЗаявок <= 4 Тогда
	//		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В отделе «%1» на %2 есть %3 заявки!", ТекСтр.Отдел, Формат(ТекСтр.ДеньПериода,"ДФ=dd.MM.yyyy"), ТекСтр.КолвоЗаявок));
	//	Иначе
	//		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В отделе «%1» на %2 есть %3 заявок!", ТекСтр.Отдел, Формат(ТекСтр.ДеньПериода,"ДФ=dd.MM.yyyy"), ТекСтр.КолвоЗаявок));
	//	КонецЕсли;
	//КонецЦикла;
	
	////преобразуем в непрерывные интервалы
	//НовТабПересечений = Новый ТаблицаЗначений;
	//НовТабПересечений.Колонки.Добавить("Отдел");
	//НовТабПересечений.Колонки.Добавить("КолвоЗаявок");
	//НовТабПересечений.Колонки.Добавить("НачДень");
	//НовТабПересечений.Колонки.Добавить("КонДень");
	
	ВыборкаПоОтделам.Сбросить();
	
	СтруктураПоиска = Новый Структура("Отдел"); 
	
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	
	Пока ВыборкаПоОтделам.Следующий() Цикл
		
		Обл1_отдел.Параметры.Отдел = ?(ЗначениеЗаполнено(ВыборкаПоОтделам.Отдел), ВыборкаПоОтделам.Отдел, "<не указан отдел>");
		
		ДокументРезультат.Вывести(Обл1_отдел, 1);
		ДокументРезультат.Присоединить(Обл_НачОст_отдел);
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
		//вот тут в области отдела рассчитать пересечения и отобразить цветом
		
		Для Каждого ТекМесяц Из МассивМесяцов Цикл
			КонецТекМесяца = День(ТекМесяц);
			Если КонецТекМесяца = 28 Тогда
				ДокументРезультат.Присоединить(Обл_28_отдел);
			ИначеЕсли КонецТекМесяца = 29 Тогда
				ДокументРезультат.Присоединить(Обл_29_отдел);
			ИначеЕсли КонецТекМесяца = 30 Тогда
				ДокументРезультат.Присоединить(Обл_30_отдел);
			ИначеЕсли КонецТекМесяца = 31 Тогда
				ДокументРезультат.Присоединить(Обл_31_отдел);
			КонецЕсли;
			
		КонецЦикла;	
		
		СтруктураПоиска.Отдел = ВыборкаПоОтделам.Отдел;
		СписокПересеченийВЭтомОтделе = ТаблицаПересеченийВОтделе.НайтиСтроки(СтруктураПоиска);
		Если СписокПересеченийВЭтомОтделе.Количество() = 0 Тогда
		Иначе
			СмещениеОтНачала = ВычислитьСмещение(ПериодОтчета.ДатаНачала);
			Для Каждого СтрокаПересечения Из СписокПересеченийВЭтомОтделе Цикл
				
				НачКолонка = КоличествоКолонокСДанными + ДеньГода(СтрокаПересечения.ДеньПериода) - СмещениеОтНачала;
				ТекОбласть = ДокументРезультат.Область(СчетчикСтрок, НачКолонка, СчетчикСтрок, НачКолонка);
				ШаблонПримечания = "%1, %2 отпуска";
				Если СтрокаПересечения.КолвоЗаявок = 2 Тогда
					ТекОбласть.ЦветФона = ЦветЗаявки;
				ИначеЕсли СтрокаПересечения.КолвоЗаявок = 3 Тогда
					ТекОбласть.ЦветФона = ЦветОтменено;
				ИначеЕсли СтрокаПересечения.КолвоЗаявок = 4 Тогда
					ТекОбласть.ЦветФона = ЦветЧерный;
				Иначе
					ТекОбласть.ЦветФона = ЦветЧерный;
					ШаблонПримечания = "%1, %2 отпусков";
				КонецЕсли;
				
				ТекОбласть.Обвести(ТочечнаяЛиния, ТочечнаяЛиния, ТочечнаяЛиния, ТочечнаяЛиния);
				ТекОбласть.Примечание.Текст = СтрШаблон(ШаблонПримечания, Формат(СтрокаПересечения.ДеньПериода, "ДФ='dd MMMM'"), СтрокаПересечения.КолвоЗаявок);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ДокументРезультат.Присоединить(Обл_Итого_отдел);
		ДокументРезультат.Присоединить(Обл_КонОст_отдел);
		
		ВыборкаПоСотрудникам = ВыборкаПоОтделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСотрудникам.Следующий() Цикл
			
			Обл1.Параметры.НПП = НПП;
			Обл1.Параметры.ФИО = ВыборкаПоСотрудникам.ФИО;// + "(это должность)";
			Обл1.Параметры.Сотрудник = ВыборкаПоСотрудникам.Сотрудник;
			
			ДокументРезультат.Вывести(Обл1, 2);
			НачОстаток = ПолучитьНачальныйОстаток(ВыборкаПоСотрудникам.Сотрудник, ОстаткиНаНачалоГода);
			Обл_НачОст.Параметры.НачОстаток = НачОстаток;
			ДокументРезультат.Присоединить(Обл_НачОст);
			
			СчетчикСтрок = СчетчикСтрок + 1;
			
			НПП = НПП + 1;
			
			Для Каждого ТекМесяц Из МассивМесяцов Цикл
				КонецТекМесяца = День(ТекМесяц);
				
				Если КонецТекМесяца = 28 Тогда
					
					Обл_28.Область(1,1,1,28).ЦветФона = ЦветОбычный;
					ДокументРезультат.Присоединить(Обл_28);
					
				ИначеЕсли КонецТекМесяца = 29 Тогда
					
					Обл_29.Область(1,1,1,29).ЦветФона = ЦветОбычный;
					ДокументРезультат.Присоединить(Обл_29);
					
				ИначеЕсли КонецТекМесяца = 30 Тогда
					
					Обл_30.Область(1,1,1,30).ЦветФона = ЦветОбычный;
					Обл_30.Область(1,25,1,25).ГраницаСправа = НетЛинии;
					Если Месяц(ТекМесяц) = 4 Тогда
						Если флВыделятьЦветомОтчетныеПериоды Тогда
							Обл_30.Область(1,1,1,25).ЦветФона 		= ЦветОтчетныйПериод;
							Обл_30.Область(1,25,1,25).ГраницаСправа = СплошнаяЛиния;
						КонецЕсли;
					КонецЕсли;
					
					ДокументРезультат.Присоединить(Обл_30);
					
				ИначеЕсли КонецТекМесяца = 31 Тогда
					
					Обл_31.Область(1,1,1,31).ЦветФона = ЦветОбычный;
					Обл_31.Область(1,25,1,25).ГраницаСправа = НетЛинии;
					Если Месяц(ТекМесяц) = 1 ИЛИ Месяц(ТекМесяц) = 7 ИЛИ Месяц(ТекМесяц) = 10 Тогда
						Если флВыделятьЦветомОтчетныеПериоды Тогда
							Обл_31.Область(1,1,1,25).ЦветФона 		= ЦветОтчетныйПериод;
							Обл_31.Область(1,25,1,25).ГраницаСправа = СплошнаяЛиния;
						КонецЕсли;
					КонецЕсли;
					
					ДокументРезультат.Присоединить(Обл_31);
					
				КонецЕсли;
				
			КонецЦикла; 
			
			//вот тут надо получить заявки, и их объединить
			ВыборкаПоЗаявкам = ВыборкаПоСотрудникам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			ИтогоКолвоДней = 0;
			
			Пока ВыборкаПоЗаявкам.Следующий() Цикл
				
				ВыборкаПоДням = ВыборкаПоЗаявкам.Выбрать();
				
				НачДень = Дата(1,1,1);
				КонДень = Дата(1,1,1);
				
				СтатусЗаявки = Перечисления.МС_СтатусыЗаявкиНаОтпуск.Заявка;
				
				Пока ВыборкаПоДням.Следующий() Цикл
					
					Если ВыборкаПоДням.ДеньПериода = Null Тогда
						Продолжить;
					КонецЕсли;
					
					ТекДень = ВыборкаПоДням.ДеньПериода;
					Если НачДень = Дата(1,1,1) Тогда
						НачДень = ТекДень;
					КонецЕсли;
					
					КонДень = КонецДня(ТекДень);
					
					СтатусЗаявки = ВыборкаПоДням.Статус;
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(НачДень) И ЗначениеЗаполнено(КонДень) Тогда
					
					Если НЕ СтатусЗаявки = Перечисления.МС_СтатусыЗаявкиНаОтпуск.Отменена Тогда
						ЧислоСекунд = (КонДень - НачДень)+1;
						КолвоДней = ЧислоСекунд / (24*60*60);
						ИтогоКолвоДней = ИтогоКолвоДней + КолвоДней;
					КонецЕсли;
					
					СмещениеОтНачала = ВычислитьСмещение(ПериодОтчета.ДатаНачала);
					НачКолонка = КоличествоКолонокСДанными + ДеньГода(НачДень) - СмещениеОтНачала;
					КонКолонка = КоличествоКолонокСДанными + ДеньГода(КонДень) - СмещениеОтНачала; //высчитать не выходим ли за границу
					ТекОбласть = ДокументРезультат.Область(СчетчикСтрок, НачКолонка, СчетчикСтрок, КонКолонка);
					
					ТекОбласть.Объединить();
					Если Объект.ВариантОтображенияДанных = 0 Тогда
						ТекОбласть.Текст = ПолучитьПредставлениеПериода(НачДень, КонДень);
					ИначеЕсли Объект.ВариантОтображенияДанных = 1 Тогда
						ТекОбласть.Текст = Формат(КолвоДней, "ЧН=0; ЧГ=0");
					КонецЕсли;
					ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
					ТекОбласть.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
					ТекОбласть.Расшифровка = ВыборкаПоЗаявкам.Регистратор;
					ТекстПримечания = СтрШаблон("С %1 по %2
					|Длительность %3 календарных дней", Формат(НачДень, "ДФ='d MMMM'"), Формат(КонДень, "ДФ='d MMMM'"), Формат(КолвоДней, "ЧН=0; ЧГ=0"));
					
					КомментарийДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаПоЗаявкам.Регистратор, "Комментарий");
					Если НЕ ПустаяСтрока(КомментарийДокумента) Тогда
						ТекстПримечания = ТекстПримечания + Символы.ПС + "Комментарий: «"+ КомментарийДокумента + "»";
					КонецЕсли;
					
					ТекОбласть.Примечание.Текст = ТекстПримечания;
					
					Если СтатусЗаявки = Перечисления.МС_СтатусыЗаявкиНаОтпуск.Заявка Тогда
						ТекОбласть.ЦветФона = ЦветЗаявки;
					ИначеЕсли СтатусЗаявки = Перечисления.МС_СтатусыЗаявкиНаОтпуск.Выполнена Тогда
						ТекОбласть.ЦветФона = ЦветВыполнено;
					ИначеЕсли СтатусЗаявки = Перечисления.МС_СтатусыЗаявкиНаОтпуск.Согласована Тогда
						ТекОбласть.ЦветФона = ЦветСогласовано;
					ИначеЕсли СтатусЗаявки = Перечисления.МС_СтатусыЗаявкиНаОтпуск.Утверждена Тогда
						ТекОбласть.ЦветФона = ЦветУтверждено;
					ИначеЕсли СтатусЗаявки = Перечисления.МС_СтатусыЗаявкиНаОтпуск.Отменена Тогда
						ТекОбласть.ЦветФона = ЦветОтменено;
					КонецЕсли;
					
					ТекОбласть.Обвести(СплошнаяЛиния, СплошнаяЛиния, СплошнаяЛиния, СплошнаяЛиния);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Обл_Итого.Параметры.ИтогоДней = Формат(ИтогоКолвоДней, "ЧН=0; ЧГ=0");
			ДокументРезультат.Присоединить(Обл_Итого);
			Обл_КонОст.Параметры.КонОстаток = НачОстаток + 28 - ИтогоКолвоДней;
			ДокументРезультат.Присоединить(Обл_КонОст);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
	ДокументРезультат.ОтображатьСетку 		= Ложь;
	ДокументРезультат.ОтображатьГруппировки = Истина;
	ДокументРезультат.ОтображатьЗаголовки 	= Ложь;
	ДокументРезультат.ТолькоПросмотр 		= Истина;
	
	ДокументРезультат.ФиксацияСверху 	= 2;
	ДокументРезультат.ФиксацияСлева 	= 2; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДокументРезультат;	

КонецФункции // ПечатьГрафикОтпусковСотрудников()

&НаСервереБезКонтекста
Функция ВычислитьСмещение(НачДатаОтчета)
	
	Рез = 0;
	Если НачДатаОтчета = НачалоГода(НачДатаОтчета) Тогда
		Возврат Рез;
	КонецЕсли;
	
	ДеньГодаНачОтчета = ДеньГода(НачДатаОтчета)-1;
	
	Рез = ДеньГодаНачОтчета - 1;
	
    Возврат Рез;
	
КонецФункции // ВычислитьСмещение()

&НаСервереБезКонтекста
Функция ПодготовитьМассивМесяцов(НачДата, КонДата)
	
	Масс = Новый Массив;
	ТекМ = КонецМесяца(НачДата);
	
	Пока ТекМ <= КонецМесяца(КонДата) Цикл
		Масс.Добавить(ТекМ);
		ТекМ = КонецМесяца(ТекМ + 100);
	КонецЦикла;	
	
	Возврат Масс;

КонецФункции // ПодготовитьМассивМесяцов()

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеПериода(НачДень, КонДень)
	
	Если НачалоДня(НачДень) = НачалоДня(КонДень) Тогда
		//1 день, не умещаемся
		Стр = СтрШаблон("%1", Формат(НачДень,"ДФ=d"));
	//ИначеЕсли Месяц(НачДень) = Месяц(КонДень) Тогда
	Иначе
		Стр = СтрШаблон("%1-%2", Формат(НачДень,"ДФ=d"),Формат(КонДень,"ДФ=d"));
	//Иначе
	//	Стр = СтрШаблон("%1-%2", Формат(НачДень,"ДФ=d.M"), Формат(КонДень, "ДФ=d.M"));
	КонецЕсли;
	
	Возврат Стр;

КонецФункции // ПолучитьПредставлениеПериода()

&НаКлиенте
Процедура Сформировать(Команда)
	
	ПечатьГрафикОтпусковСотрудников();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтделов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФЛ.Подразделение КАК Отдел,
	|	ФЛ.Подразделение.Наименование КАК ОтделНаименование
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФЛ
	|ГДЕ
	|	НЕ ФЛ.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтделНаименование";
	
	Элементы.ОтборПоПодразделению.СписокВыбора.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.ОтборПоПодразделению.СписокВыбора.Добавить(Выборка.Отдел);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСписокВыбораОтделов()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//отладка
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.ОтборПоСотруднику.Видимость = Истина;
	Иначе
		Элементы.ОтборПоСотруднику.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораОтделов();
	
	флВыводитьЗаявки 		= Истина;
	флВыводитьСогласованные = Истина;
	флВыводитьУтвержденные 	= Истина;
	флВыводитьВыполненные 	= Истина;
	флВыводитьОтмененные 	= Истина;
	
	ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПериодОтчета.ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
	ПериодОтчета.ДатаОкончания = КонецГода(ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура флВыводитьЗаявкиПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура флВыводитьСогласованныеПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура флВыводитьУтвержденныеПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура флВыводитьВыполненныеПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура флВыводитьОтмененныеПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура флВыделятьЦветомОтчетныеПериодыПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтображенияДанныхПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПодразделениюПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСотрудникуПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабличныйДокумент() Экспорт
	
	ПечатьГрафикОтпусковСотрудников();

КонецПроцедуры // ОбновитьТабличныйДокумент()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "МС_ИзменениеЗаявкиНаОтпуск" Тогда
		ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВидуОтпускаПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьТабличныйДокумент", 0.1, Истина);
КонецПроцедуры
